hectorchu/esp-board-common/boards/waveshare_p4_lcd35/sdkconfig.defaults
# Waveshare ESP32-P4 WiFi6 Touch LCD 3.5
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# SPI display requires ISR in IRAM so SPI transaction interrupts are not
# blocked by flash cache misses. Without this, display DMA from SPIRAM fails.
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# Disable power management: PM clock gating can scale down APB clock and
# gate SPI peripheral clocks, causing display transactions to fail.
CONFIG_PM_ENABLE=n
